[
    {
        "movie_id": 1,
        "name": "Dr Steven Hoi",
        "org": "Managing Director, Salesforce Research Asia",
        "image": "images/steven.png",
        "imageLarge": "images/steven_hoi.jpg",
        "type": 4,
        "typename": "ml",
        "star": 5,
        "boxOffice": 50000000,
        "director": "Stephen Covey",
        "releaseDate": "2020-09-09",
        "title": "Multimodal Intelligence: Foundation Models and Beyond",
        "abstract": "",
        "description": "Dr Steven Hoi is currently Managing Director of Salesforce Research Asia and VP of AI Research at Salesforce and oversees Salesforce’s AI research and innovation in APAC. He has been a tenured professor for 15 years at two Singapore universities, including full professor (on leave) at SMU and formerly Associate Professor at NTU. He has worked in machine learning and AI for 20+ years and published 250+ papers. He had served as the Editor-in-Chief (EiC) of Neurocomputing, and Associate Editor (AE) for several top AI journals, Area Chair and Senior PC for many top conferences. He was elevated to IEEE Fellow (2019) and named as ACM Distinguished Member (2019) for his significant contributions to the AI and computing fields."
    },
    {
        "movie_id": 3,
        "name": "Dr Carlos Queiroz",
        "org": "Head of Data Science Engineering, CCIB",
        "image": "images/carlos_queiroz2.jpg",
        "imageLarge": "images/carlos_queiroz.jpg",
        "type": 4,
        "typename": "ml",
        "star": 4,
        "boxOffice": 20000000,
        "director": "Jack Donkey",
        "releaseDate": "2021-08-08",
        "title": "Making Defence your best Attack - How MLOps can make you comply with regulatory requirements (Responsible AI and others) and help you drive ROI on AI-based applications/processes.",
        "abstract": "",
        "description": "Dr. Carlos Queiroz is currently the Head of Data Science Engineering for CCIB, where he is responsible for Data Management, Machine Learning Engineering and Data Assets. He has accumulated more than twenty years building critical systems applications, from legacy, client/server applications to enterprise data platforms. In his previous organisation, he was responsible to build and run their enterprise data platform. He comes from Academia where his expertise was around streaming data applications. He’s got a PhD in Computer Science from RMIT University, in Melbourne, Australia."
    },
    {
        "movie_id": 2,
        "name": "Dr Masoumeh Izadi",
        "org": "Managing Director, TV Content Analytics",
        "image": "images/izadi.png",
        "imageLarge": "images/masoumeh.jpg",
        "type": 2,
        "typename": "ai",
        "star": 5,
        "boxOffice": 50000000,
        "director": "Zimmerman C.",
        "releaseDate": "2021-08-08",
        "title": "Play, Consume, and Innovate Sports in AI",
        "abstract": "Data will continue to play a significant role in sports from performance and player development to consumer engagement perspectives. Detailed accurate data collection has become more important and valuable as the sport has evolved. The industry stakeholders have no question about video content being a valuable source of data. An increasing amount of digital sports content is generated and made available through television broadcasts or streaming over the internet. However, the content is not used to its full potential due to the tedious work required to tag, curate, and extract value. Increased levels of data that teams and fans are interested in require an extensive and skilled team of operators and professionals to collect and analyze for broadcast and use by teams' coaching and analytics departments. The introduction of automation across the entire workflow of data collection, processing, curation, and maintenance has a significant impact on overcoming the challenges of data utilization from live sporting events and archived content. In this talk, we discuss AI applications across the entire workflow of data in sports, addressing the problem of automated tagging in a domain-specific software system built on computer vision and machine learning.",
        "description": "Dr. Masoumeh Izadi serves as the founder and managing director at TVCONAL, a Singapore-based AI company in media and sports.  She currently directs innovative technologies in sports analytics that target the automated creation of more enjoyable, educational, and engaging sports content for viewers and fans. Masoumeh also holds an academic position on the advisory board of Deakin University in Australia. She received a Ph.D. degree in artificial intelligence from McGill University in Canada and served in academic positions at McGill prior to founding TVCONAL."
    },
    {
        "movie_id": 4,
        "name": "Professor Lee Wee Sun",
        "org": "Head of Department, NUS Department of Computer Science",
        "image": "images/leeweesun2.jpg",
        "imageLarge": "images/leeweesun.jpg",
        "type": 2,
        "typename": "ai",
        "star": 5,
        "boxOffice": 10000000,
        "director": "Niki Caro",
        "releaseDate": "2019-09-09",
        "title": "Exploiting Pre-trained Models, Compositionality, and Reasoning Algorithms for Visual-Language Object Placement",
        "abstract": "A major cost in building a system with machine learning is the cost of acquiring labeled data. In many tasks, we have multiple sources of information that can be utilized in order to reduce the amount of labeled data required. In this talk, we focus on using pre-trained or foundation models, using natural decomposition of the system, and exploiting known reasoning algorithms. We illustrate our approach using a visual-language task of object placement by following verbal instructions. In this task, we decompose the system into a natural language instruction parsing component, an object detection component, a grounding component that aligns the natural language with the visual objects and relations, and a reasoning component that infers the final position to place the target object. Each of these components are designed to be differentiable and can be composed into a larger differentiable system to facilitate learning by gradient descent. A pre-trained visual-language model is used to provide the visual and language embeddings for the objects and the system is trained end-to-end for the object placement task. We illustrate how the different sources of information reduce the amount of labeled data required for training the system.",
        "description": "Professor Lee Wee Sun is a professor in the Department of Computer Science, National University of Singapore. He obtained his B.Eng from the University of Queensland in 1992 and his Ph.D. from the Australian National University in 1996. He has been a research fellow at the Australian Defence Force Academy, a fellow of the Singapore-MIT Alliance, and a visiting scientist at MIT. His research interests include machine learning, planning under uncertainty, and approximate inference. His works have won the IJCAI-JAIR Best Paper Prize 2022, the Test of Time Award at Robotics: Science and Systems (RSS) 2021, the RoboCup Best Paper Award at International Conference on Intelligent Robots and Systems (IROS) 2015, the Google Best Student Paper Award at Uncertainty in AI (UAI) 2014 (as faculty co-author), as well as several competitions and challenges. He has been an area chair for machine learning and AI conferences such as the Neural Information Processing Systems (NeurIPS), the International Conference on Machine Learning (ICML), the AAAI Conference on Artificial Intelligence (AAAI), and the International Joint Conference on Artificial Intelligence (IJCAI). He was a program, conference and journal track co-chair for the Asian Conference on Machine Learning (ACML), and he is currently the chair of the steering committee of ACML."
    },
    {
        "movie_id": 5,
        "name": "Mr Amenallah Reghimi",
        "org": "CTO, Perx Technologies",
        "image": "images/amenallah_reghimi2.jpg",
        "imageLarge": "images/amenallah_reghimi.jpg",
        "type": 3,
        "typename": "data_science",
        "star": 5,
        "boxOffice": 10000000,
        "director": "Niki Caro",
        "releaseDate": "2019-09-09",
        "title": "Building Intelligent Applications: A Blueprint for Harnessing the Power of Data, AI, and Analytics to Drive Business",
        "abstract": "Are you ready to take your business or project to the next level with the power of Artificial Intelligence? Building an intelligent application can seem daunting, but it doesn't have to be. In this keynote talk, we will show you how to harness the power of data, AI, and analytics to create cutting-edge applications that will give you a competitive edge in today's fast-paced business world. We'll demystify the buzzwords and provide real-world examples and use cases to give you a clear understanding of the process. You'll learn best practices for selecting the right AI techniques, preprocessing your data, training and evaluating your models, and deploying them to production. We'll also provide you with hands-on demonstration, allowing you to understand how to use data and AI together to build intelligent applications that can drive innovation and growth. You'll come away from the talk with a toolbox of knowledge and resources that you can apply to your own projects and businesses. Don't miss out on this opportunity to take your skills to the next level and stay ahead of the curve. Join us for a deep-dive into the world of AI and leave with the knowledge and confidence to start building your own intelligent applications",
        "description": "Amen is a recognized technology industry executive and a business-minded organizational leader. He has a wealth of experience working with customers, private equity firms, venture capitalists, analysts, and the media, and is skilled at managing relationships with board members. As a Chief Product & Technology Officer at Perx Technologies, the world's first loyalty management & customer engagement platform that combines the power of science with the excitement of gamification, Amen is responsible for aligning the company's technology strategy with business objectives.Previously, as a Vice President of Product Management and member of the leadership team at JAGGAER, he successfully oversaw all facets of a portfolio of 18 products and developed the first generation of JAGGAER’s Intelligent Solution branded as Digital Mind. His focus on Intelligent Solutions & Innovation has earned him many accolades as a Global Thought Leader, Innovator and Tech Philanthropist. Over the last few years, Thinkers360 honored him with multiple titles including \"No. 1 in COVID-19 Business Impact,\" \"No. 1 in Open Innovation\" and \"No. 3 in Procurement\". In 2021 & 2022, he has been named as recipient of Supply and Demand Chain Executives Pros to Know Award."
    },
    {
        "movie_id": 6,
        "name": "Professor Cheng Shih Fen",
        "org": "Associate Professor of Computer Science, School of Computing and Information Systems, Singapore Management University",
        "image": "images/chengshihfen.jpg",
        "imageLarge": "images/chengshihfen.jpg",
        "type": 3,
        "typename": "data_science",
        "star": 5,
        "boxOffice": 10000000,
        "director": "Niki Caro",
        "releaseDate": "2019-09-09",
        "title": "Computational Models of Human Strategic Behavior",
        "abstract": "",
        "description": ""
    },
    {
        "movie_id": 7,
        "name": "Mr Sumit Kumar",
        "org": "Vice President, Global Commercial Risk Decision Science (Credit & Fraud Risk), American Express Innovation Laboratories Limited",
        "image": "images/sumit.png",
        "imageLarge": "images/sumit.png",
        "type": 3,
        "typename": "data_science",
        "star": 5,
        "boxOffice": 10000000,
        "director": "",
        "releaseDate": "2019-09-09",
        "title": "How the Risk Landscape Evolved through Pandemic",
        "abstract": "Sumit will talk about how their AI/ML practice evolved during the pandemic. Also, how their views on some data had to change during COVID-19. As well as what new data elements became more important.",
        "description": ""
    },
    {
        "movie_id": 8,
        "name": "Mr John Wang",
        "org": "Staff Software Engineer, Bytedance",
        "image": "images/johnwang.jpg",
        "imageLarge": "images/johnwang.jpg",
        "type": 2,
        "typename": "ai",
        "star": 5,
        "boxOffice": 0,
        "director": "",
        "releaseDate": "2019-09-09",
        "title": "Practice of Code Intelligence in Bytedance",
        "abstract": "The rapid growth of ByteDance is accompanied by a significant increase in source codes, including client applications, microservices, shared libraries, and helper scripts. These codes aim to ensure stable content delivery and efficient research and development processes. Dev Infra team dedicated themselves to code graph and code discovery, resulting in significant improved developer experience. However, some challenges remain, such as inconsistent or careless implementation by engineers who may reuse similar code snippets, leading to duplicated defects and security issues. To address these challenges, the team continued to explore Code Intelligent Solutions. John will introduce two main internal services that will make it easier for developers to maintain code quality in the development process.",
        "description": "John is a staff software engineer at Bytedance Singapore, and currently dedicated to providing and optimizing the company's internal code management and search products. John obtained a bachelor's degree in Computer Science from East China University of Science and Technology in 2011 and his MSc from University of Bath in 2017. John has over 10 years of software development experience and has previously worked at Array Networks and Intel's Asia-Pacific R&D Center."
    }
]
