[
    {
        "movie_id": 1,
        "name": "Dr Hu Zeyu",
        "org": "Lightspeed Studios Singapore",
        "image": "images/2024/huzeyu.jpg",
        "imageLarge": "images/2024/huzeyu.jpg",
        "type": 2,
        "typename": "ai",
        "star": 5,
        "boxOffice": 50000000,
        "director": "Stephen Covey",
        "releaseDate": "2020-09-09",
        "title": "Advancing Game Content Creation with LightSpeed's Self-developed Generative AI Technology",
        "abstract": "Lightspeed Studios unveils the transformative power of AI-Generated Content (AIGC) in shaping the future of game content creation. Our presentation will outline the sophisticated AIGC technologies that are redefining how game environments, characters, and interactions are conceived and delivered. From intricate 3D models to lifelike animations and dialogue, we will showcase the breadth of our AIGC's capabilities and its impact on elevating gaming to unprecedented levels of realism and engagement.",
        "description": "Zeyu Hu is a senior AI researcher at LightSpeed Studios Singapore, where his expertise in AI-driven game content creation has significantly contributed to the studio's pioneering efforts in the field. Before joining LightSpeed, he obtained his Ph.D. degree (2018-2023) at the Vision and Graphics Group, part of the Department of Computer Science and Engineering at the Hong Kong University of Science and Technology. His Ph.D. advisor was Prof. Chiew-Lan Tai, and he also worked closely with Prof. Long Quan and Prof. Hongbo Fu."
    },
    {
        "movie_id": 2,
        "name": "Asst Prof Liu Jun",
        "org": "Singapore University of Technology and Design",
        "image": "images/2024/liujun.png",
        "imageLarge": "images/2024/liujun.png",
        "type": 2,
        "typename": "ai",
        "star": 4,
        "boxOffice": 20000000,
        "director": "Jack Donkey",
        "releaseDate": "2021-08-08",
        "title": "Diffusion Models for 3D Human Pose and Mesh Recovery",
        "abstract": "3D pose and mesh recovery is important for human behaviour understanding and game development. Meanwhile, diffusion models have achieved impressive performance for image and video generation tasks. We are the first to apply diffusion models to handle 3D pose and mesh recovery from monocular images and videos, and we created several key techniques enabling diffusion models to work well in handling this task.",
        "description": "Jun Liu is an assistant professor in Singapore University of Technology and Design. His research interests include computer vision and artificial intelligence. He has published more than 100 papers in premier computer vision journals and conferences, including TPAMI, CVPR, ICCV, and ECCV. He is listed in the top 2% scientists worldwide identified by Stanford University in 2021-2023. He is an Associate Editor of IEEE Transactions on Image Processing and IEEE Transactions on Biometrics, Behavior, and Identity Science, and serves as an Area Chair of top-tier conferences, like CVPR, ECCV, ICML, NeurIPS, and ICLR. His Google Scholar citations reach 11000."
    },
    {
        "movie_id": 3,
        "name": "Associate Professor Zhu Feida",
        "org": "School of Information Systems, SMU",
        "image": "images/2024/zhufeida.png",
        "imageLarge": "images/2024/zhufeida.png",
        "type": 2,
        "typename": "ai",
        "star": 5,
        "boxOffice": 50000000,
        "director": "Zimmerman C.",
        "releaseDate": "2021-08-08",
        "title": "TBA",
        "abstract": "",
        "description": ""
    },
    {
        "movie_id": 4,
        "name": "Ms Neo Yi Lin",
        "org": "Deputy Director, Health Promotion Board",
        "image": "images/2024/neoyilin.png",
        "imageLarge": "images/2024/neoyilin.png",
        "type": 3,
        "typename": "data_engineering",
        "star": 5,
        "boxOffice": 10000000,
        "director": "Niki Caro",
        "releaseDate": "2019-09-09",
        "title": "Enabling Precision in Public Health through Data Democratisation",
        "abstract": "The advancement of technology and the increasing uptake of wearable health devices has unlocked great potential for public health. However, organisations have typically relied on specialised teams of IT experts to process and analyse these data for high-level planning purposes. It is becoming increasingly important for data to be brought to the forefront in an accessible manner, beyond specialised teams, to all within the organisation. For example, business users can make use data to design and manage successful health programmes customised to individuals’ lifestyle patterns. The Health Promotion Board recently set up an independent team to specially look into how data can be better democratised for improved business operations. Learn about how we’re working to overcome challenges to bridge the analytics gap with support from our industry partners.",
        "description": "Ms Neo Yi Lin is a Deputy Director in the Chief Data Officer’s Office (CDOO) of Health Promotion Board. She heads the Data Engineering and Architecture department and is responsible for streamlining disparate health and lifestyle data into an integrated data repository. Beside ensuring the availability of trusted and quality data, Yi Lin also guides the team to productise common data needs to support data-driven decision making through HPB.  Prior to her current role, Yi Lin was with the Workplace Outreach Division and led the outreach strategy department to assist companies and workers to set up robust workplace health promotion programmes. Yi Lin was also a key member of the tobacco control unit and was primarily focused on driving tobacco control policies such as the ban on flavoured tobacco products, shisha and point-of-sales displays. She was also involved in developing smoking cessation programmes among lower income groups."
    },
    {
        "movie_id": 5,
        "name": "Mr Robert Brockman",
        "org": "Vice President, Digital Solutions Marketing & Product development, Meiyume",
        "image": "images/2024/robert-brockman-iv.jpg",
        "imageLarge": "images/2024/robert-brockman-iv.jpg",
        "type": 2,
        "typename": "ai",
        "star": 5,
        "boxOffice": 10000000,
        "director": "Niki Caro",
        "releaseDate": "2019-09-09",
        "title": "Smart Beauty Trend Engine for Beauty Product Trend Analysis",
        "abstract": "The MEIYUME and NUS Beauty Intelligence Platform revolutionizes the beauty industry with its real-time trend validation and detailed analysis of product sentiment, claims efficacy, consumer feedback, and competitor performance. This advanced AI tool provides vital insights at scale, helping Meiyume’s clients stay ahead in the fast-changing beauty market by aligning with consumer preferences and upcoming trends.",
        "description": "Robert Brockman is a seasoned Information Technology professional with over 15 years of experience driving digital innovation and transformation. His expertise lies in developing and executing strategic digital initiatives, leveraging emerging technologies, and fostering a digital-first culture to deliver sustainable business growth. Robert also drive research project within the data analytics centre in Meiyume and strategies for future R&D such as consumer behaviour and AI machine learning for further customer data insights. He is currently overseeing cross-functional teams and built lasting partnerships with stakeholders to align digital strategies with overall business objectives. Passionate about harnessing the power of data, Robert also has a strong track record of enhancing digital performance through data-driven decision-making."
    }
]
