[
    {
        "movie_id": 1,
        "name": "Assoc Prof Daniel Wang Zhengkui",
        "org": "Data Science and AI Lab, Singapore Institute of Technology",
        "image": "images/wangzhengkui.jpg",
        "imageLarge": "images/wangzhengkui.jpg",
        "type": 2,
        "typename": "ai",
        "star": 5,
        "boxOffice": 50000000,
        "director": "Stephen Covey",
        "releaseDate": "2020-09-09",
        "title": "Data Science in Practice: Unleashing the Power of Data for Real-World Impact",
        "abstract": "",
        "description": "Dr. Daniel Wang Zhengkui is an associate professor and the director of the Data Science & AI Lab in Singapore Institute of Technology. His research brings together the fields of Data Science, Artificial Intelligence, and Big Data. He and his team have worked very closely and intensively with various local industry and government sectors to tackle their real-world problems. He is intrigued into investigate the next generation of AI and Data-driven technologies and Innovations. His works have been published in more than 40 papers in various international prestigious conferences and journals in these domains, such as ACM SIGMOD, KDD, AAAI, IJCAI, FSE, ICDE, TKDE, Bioinformatics etc. He is the recipient of various awards for his research contributions, such as “Best Paper Award” in ICPR 2022, the “Economy Drive Award” in SIT 2022, the “Digital Initiative Award” in SIT 2022, the “Best Paper Presentation award” in ACCC 2021 etc."
    },
    {
        "movie_id": 2,
        "name": "Assoc Prof Sourav S Bhowmick",
        "org": "the School of Computer Science and Engineering, NTU",
        "image": "images/sourav.jpg",
        "imageLarge": "images/sourav.jpg",
        "type": 3,
        "typename": "data_science",
        "star": 4,
        "boxOffice": 20000000,
        "director": "Jack Donkey",
        "releaseDate": "2021-08-08",
        "title": "Data-driven Management of COI in Peer-review Venues: Data Science in the Real World",
        "abstract": "Upholding high standards of fairness is central to review processes in peer-reviewed scientific conferences. To this end, many aspects of review and selection processes have been strengthened over the past 50 years, but the ways we declare and detect conflicts of interest (COI) have changed little if at all. In this talk, we present an end-to-end data science system called CLOSET (https://cacm.acm.org/magazines/2023/7/274068-closet-data-driven-coi-detection-and-management-in-peer-review-venues/fulltext) to automatically detect and manage unreported COIs efficiently and effectively for peer-review conferences by leveraging data analytics, network science, and social psychology. Given a set of reviewers assigned to each paper by a review management system (RMS) hosting a specific conference, it automatically detects a set of conflict papers along with possible explanations for COI, where each paper has at least one author-reviewer pair with undeclared COI. To date, CLOSET has been deployed in more than 18 major conference venues in the areas of data management, data science, and theoretical computer science. In particular, it has significantly impacted the way COIs are managed in these venues by influencing changes to the specifications and implementation of long-standing COI policies.",
        "description": "Sourav S. Bhowmick is an Associate Professor in the School of Computer Science and Engineering (SCSE), Nanyang Technological University and the Program Director of MSc (Data Science) programme. His core research expertise is in data management, human-data interaction, and data analytics. His research has appeared in premium venues such as ACM SIGMOD, VLDB, and VLDB Journal. He is co-recipient of Best Paper Awards in ACM CIKM 2004, ACM BCB 2011, and VLDB 2021. He is also a co-recipient of the 2022 ACM SIGMOD Research Highlights Award. Sourav is serving as a member of the SIGMOD Executive Committee, a regular member of the PVLDB advisory board, and a co-lead in the committee for Diversity and Inclusion in Database Conference Venues. He is a co-recipient of several service awards including VLDB Service Award in 2018, Distinguished AE Award in SIGMOD 2021, SIGMOD 2023, and VLDB 2022, and Distinguished Reviewer Award in 2020. Sourav was inducted into Distinguished Members of the ACM in 2020. He is a strong advocate of research that directly or indirectly impacts end users."
    },
    {
        "movie_id": 3,
        "name": "Asst Prof Roy Ka-Wei Lee",
        "org": "Information Systems and Design, SUTD",
        "image": "images/roy.jfif",
        "imageLarge": "images/roy.jfif",
        "type": 2,
        "typename": "ai",
        "star": 5,
        "boxOffice": 50000000,
        "director": "Zimmerman C.",
        "releaseDate": "2021-08-08",
        "title": "Hateful Content Moderation with Data Science & AI",
        "abstract": "Online hate speech threatens the unity of digital communities and poses real-world safety risks. This growing problem has led researchers to devise a variety of traditional machine learning and advanced deep learning techniques to identify and neutralize such harmful content on social media platforms automatically. Our discussion will delve into the urgent issue of online hate speech and the automated detection methods designed to combat it. We'll focus on various Data Science and Natural Language Processing (NLP) strategies employed for hate speech detection, and will shed light on exciting future avenues of research, including multimodal and multilingual hate speech detection.",
        "description": "Roy Ka-Wei Lee is an Assistant Professor at the Information Systems Technology and Design Pillar, Singapore University of Technology and Design. He is appointed Deputy Sector Lead of SUTD AI Mega Center. His research lies in the intersection of data mining, machine learning, social computing, and natural language processing. He is leading the Social AI Studio, which focuses on designing next-generation social artificial intelligence systems. He has published in top-tier venues in data mining, computation linguistics, and artificial intelligence domains such as IEEE TKDE, IEEE TNNLS, IEEE ICME, IEEE ICDM, ACM Multimedia, SIGKDD, IJCAI, WWW, ACL, EMNLP, COLING, etc. He also serves on the program committees of these top conferences and is a reviewer for the top journals. He is a senior IEEE member."
    },
    {
        "movie_id": 4,
        "name": "Ms Tidaporn Santimanawong",
        "org": "Senior Director, Technology Cloud Engineer (Solution Engineer & CSM), Oracle ASEAN",
        "image": "images/tida.jpg",
        "imageLarge": "images/tida.jpg",
        "type": 3,
        "typename": "data_science",
        "star": 5,
        "boxOffice": 10000000,
        "director": "Niki Caro",
        "releaseDate": "2019-09-09",
        "title": "Oracle’s Data Driven Technology that powered F1, SailGP, Premier League strategy to win",
        "abstract": "We are transfixed by sports. Our eyes are drawn to the screen almost against our will, even when we’re not watching our favorite teams or athletes, because against the backdrop of our often too-predictable and prosaic lives, we have a chance to glimpse at greatness. • Red Bull Racing Honda uses Oracle technology to run massive numbers of simulations that help it optimize and make in-race decisions. • During televised Premier League games, for instance, Oracle and Premier League are sharing match insights like win probability, goal threat and average position. It’s the kind of statistics that any fan can relate to – and find their enjoyment of the game enhanced. But it’s also an example of how data can be gathered and analyzed in real time. • Crews of the SailGP teams have access to data during each race based on more than 240,000 data points collected from 800 sensors on the F50 vessels, allowing them to make in-race decisions based on key metrics such as speed and rudder differentials, boat altitude, speed, pitch, water, and wind conditions, as well as sailor biometrics. We don’t have to explain  how the stats are derived in the moment, but if wanted, we could go into great detail on the vast quantity and variety of data that are stored, the analysis that goes into identifying analogous historical data, preparing it for the machine learning algorithms, running the model and generating predictions, and then—all in real time—displaying the data in a way that can provide a decision-maker with actionable information. Which, in this case, is giving the decision-maker a reason to jump out of her chair and cheer.",
        "description": "Tidaporn leads the technology cloud engineering team for Oracle ASEAN. She plays an instrumental role in driving Oracle’s flagship Data Management Cloud technology. With over 30 years of experience in functional/technology and leadership, Tidaporn has excelled in leading a team of high-performance cloud engineers with deep expertise and focus on customer centricity and aims for driving customer advocacy. Tidaporn is responsible for the hypergrowth bookings and revenue of Oracle Cloud’s infrastructure-as-a-service (IaaS), platform-as-a-service (PaaS) cloud offerings and Cloud@Customer. As well as managing this business through the adoption of Oracle’s emerging cloud innovation. In the past two years, the customer success manager team has been under her portfolio. And recent once with Oracle Cloud Lift Services. More than 25 of those years have been with Oracle across different portfolios in ASEAN. Tidaporn has held other roles within the company, where she focused on technology consulting and implementation services in large, global projects across the telecommunications, financial services, and government sectors."
    },
    {
        "movie_id": 5,
        "name": "Mr CK Thum",
        "org": "Account Director, Katonic.ai",
        "image": "images/ck.png",
        "imageLarge": "images/ck.png",
        "type": 2,
        "typename": "ai",
        "star": 5,
        "boxOffice": 10000000,
        "director": "Niki Caro",
        "releaseDate": "2019-09-09",
        "title": "ChatGPT. LLMs and Generative AI: What your Business Needs to know",
        "abstract": "ChatGPT was the big bang moment for Generative AI and its explosive popularity became an inflexion point for AI’s public adoption. Large Language models are the engines fuelling the AI applications. There are multiple tasks that can be performed by LLMs, including question answering, object recognition, generating images and videos from text prompts, information extraction, and more. LLMs can facilitate multiple everyday operations like document summaries, code generation, customer engagement, social media monitoring, and many more. In this talk, we will discuss the potential of LLMs and generative AI and we will dive deep into the potential of these cutting-edge technologies and how businesses can use them to enhance their operations. We will talk about the advantages of using specialised AI applications vs publicly available AI applications, as well as the use cases for research and academics.",
        "description": "CK is seasoned software sales professional with over a decade of experience across Malaysia, South Korea, and Singapore. He specialises in cloud, automation, and AI/ML solutions. He excels at identifying customer pain points and delivering tailored solutions to address their specific needs. His communication and interpersonal skills, combined with technical knowledge, enable him to build trust with customers and provide them with the best solutions."
    },
    {
        "movie_id": 6,
        "name": "Mr Sumit Kumar",
        "org": "Vice President, Global Commercial Risk Decision Science (Credit & Fraud Risk), American Express Innovation Laboratories Limited",
        "image": "images/sumit.png",
        "imageLarge": "images/sumit.png",
        "type": 3,
        "typename": "data_science",
        "star": 5,
        "boxOffice": 10000000,
        "director": "",
        "releaseDate": "2019-09-09",
        "title": "TBA",
        "abstract": "",
        "description": ""
    }
]
